import avatar_1 from 'img/reviews/review-1.png';
import avatar_2 from 'img/reviews/review-2.png';
import avatar_3 from 'img/reviews/review-3.png';
import avatar_4 from 'img/reviews/review-4.png';

export const defaultReviewsList = [
  {
    _id: 1,
    avatar: avatar_1,
    name: 'Оксана К.',
    date: '2022-12-10T12:25:44.131Z',
    comments:
      'Дівчата, ці тістечка посто бомба-ракєта!!! Нарешті дійшов мій марципан, і я одразу приготувала, тому тепер я в графіку і в ногу з іншими учасниками курсу.',
  },
  {
    _id: 2,
    avatar: avatar_2,
    name: 'Ніка',
    date: '2022-09-15T12:25:44.131Z',
    comments:
      'Дівчата, ці тістечка посто бомба-ракєта!!! Нарешті дійшов мій марципан, і я одразу приготувала, тому тепер я в графіку і в ногу з іншими учасниками курсу.',
  },
  {
    _id: 3,
    avatar: avatar_3,
    name: 'Олександра',
    date: '2022-08-23T12:25:44.131Z',
    comments:
      'Дівчата, ці тістечка посто бомба-ракєта!!! Нарешті дійшов мій марципан, і я одразу приготувала, тому тепер я в графіку і в ногу з іншими учасниками курсу.',
  },
  {
    _id: 4,
    avatar: avatar_4,
    name: 'Олександра',
    date: '2022-05-06T12:25:44.131Z',
    comments:
      'Дівчата, ці тістечка посто бомба-ракєта!!! Нарешті дійшов мій марципан, і я одразу приготувала, тому тепер я в графіку і в ногу з іншими учасниками курсу.',
  },
];
