import { Container } from 'components/global/Container';
import React from 'react';
import {
  Box,
  LetterBox,
  PopularQuestionsBox,
  Title,
  Tip,
  ListOfQuestions,
  Form,
  Label,
  Input,
  CommentInput,
  SubmitBtn,
} from './UserProfileSupportBlank.styled';
import { QuestionListItem } from './QuestionListItem/QuestionListItem';

export function UserProfileSupportBlank() {
  const onHandleSubmit = e => {
    e.preventDefault();
    console.log('submit');
  };
  return (
    <Container>
      <Box>
        <PopularQuestionsBox>
          <Title>Популярні питання</Title>
          <ListOfQuestions>
            <QuestionListItem
              question="Чи видаються сертифікати про закінчення навчання?"
              answer="Так, ви отримаєте сертифікат, що підтверджує закінчення курсів у нашій
          кондитерській школі. Наші сертифікати гарно цінуються серед кондитерів
          та ви зможете отримати добре оплачувану роботу у провідних
          кондитерських салонах країни. Або відкрити свій бізнес та бути
          самозайнятою особою 😘"
            />
            <QuestionListItem
              question="Чи видаються сертифікати про закінчення навчання?"
              answer="Так, ви отримаєте сертифікат, що підтверджує закінчення курсів у нашій
          кондитерській школі. Наші сертифікати гарно цінуються серед кондитерів
          та ви зможете отримати добре оплачувану роботу у провідних
          кондитерських салонах країни. Або відкрити свій бізнес та бути
          самозайнятою особою 😘"
            />
            <QuestionListItem
              question="Чи видаються сертифікати про закінчення навчання?"
              answer="Так, ви отримаєте сертифікат, що підтверджує закінчення курсів у нашій
          кондитерській школі. Наші сертифікати гарно цінуються серед кондитерів
          та ви зможете отримати добре оплачувану роботу у провідних
          кондитерських салонах країни. Або відкрити свій бізнес та бути
          самозайнятою особою 😘"
            />
            <QuestionListItem
              question="Чи видаються сертифікати про закінчення навчання?"
              answer="Так, ви отримаєте сертифікат, що підтверджує закінчення курсів у нашій
          кондитерській школі. Наші сертифікати гарно цінуються серед кондитерів
          та ви зможете отримати добре оплачувану роботу у провідних
          кондитерських салонах країни. Або відкрити свій бізнес та бути
          самозайнятою особою 😘"
            />
            <QuestionListItem
              question="Чи видаються сертифікати про закінчення навчання?"
              answer="Так, ви отримаєте сертифікат, що підтверджує закінчення курсів у нашій
          кондитерській школі. Наші сертифікати гарно цінуються серед кондитерів
          та ви зможете отримати добре оплачувану роботу у провідних
          кондитерських салонах країни. Або відкрити свій бізнес та бути
          самозайнятою особою 😘"
            />
          </ListOfQuestions>
        </PopularQuestionsBox>
        <LetterBox>
          <Tip>
            Залишилися питання? Опишіть, що вас цікавить та наш спеціаліст
            передзвонить та проконсультує вас
          </Tip>
          <Form onSubmit={onHandleSubmit}>
            <Label>
              ПІБ
              <Input />
            </Label>
            <Label>
              Телефон
              <Input />
            </Label>
            <Label>
              Коментар до запису
              <CommentInput />
            </Label>
            <SubmitBtn type="submit">Надіслати</SubmitBtn>
          </Form>
        </LetterBox>
      </Box>
    </Container>
  );
}
